<h2> I am going to import the required libraries to clean the dataset </h2>

In [8]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("../Raw Data/autoinsurance_churn.csv")

<h3> Checking the dimensions of the dataset </h3>

In [4]:
df.shape

(1680909, 22)

<h3> Printing the first 5 values to take a glimpse at the data </h3>
<p> Going to set the max_columns to 'None', so that it shows all the rows without deprecating them. </p>

In [10]:
pd.set_option('display.max_columns', None)
df.head()

,individual_id,address_id,curr_ann_amt,days_tenure,cust_orig_date,age_in_years,date_of_birth,latitude,longitude,city,state,county,income,has_children,length_of_residence,marital_status,home_market_value,home_owner,college_degree,good_credit,acct_suspd_date,Churn
0,2.213000e+11,5.213000e+11,818.877997,1454.0,2018-12-09,44,1978-06-23,32.578829,-96.305006,Kaufman,TX,Kaufman,22500.0,1.0,15.0,Married,50000 - 74999,1.0,1.0,1.0,NaN,0
1,2.213001e+11,5.213001e+11,974.199182,1795.0,2018-01-02,72,1950-05-30,32.732209,-97.000893,Grand Prairie,TX,Dallas,27500.0,0.0,2.0,Single,50000 - 74999,1.0,0.0,0.0,NaN,0
2,2.213007e+11,5.213002e+11,967.375112,4818.0,2009-09-23,55,1967-07-07,32.819777,-96.846938,Dallas,TX,Dallas,42500.0,0.0,10.0,Married,75000 - 99999,1.0,0.0,0.0,NaN,0
3,2.213016e+11,5.213006e+11,992.409561,130.0,2022-07-25,53,1969-05-25,32.684065,-97.162180,Arlington,TX,Tarrant,125000.0,1.0,6.0,Married,175000 - 199999,1.0,0.0,1.0,2021-12-22,1
4,2.213016e+11,5.213006e+11,784.633494,5896.0,2006-10-11,50,1972-09-25,32.751398,-97.376745,Fort Worth,TX,Tarrant,87500.0,1.0,4.0,Married,225000 - 249999,1.0,1.0,1.0,NaN,0

<h3> Lets check if we have any duplicated records in our dataset </h3>

In [19]:
df.duplicated().sum()

0

<p> Looks like we fortunately do not have any duplicate records in our dataset and it is safe to proceed to the next step. </p>

<h3> Now, I am Going to describe the dataset to get a basic overview of all the columns </h3>
<p> We will describr the <b>number</b> type columns and the <b>object</b> type columns separately, since the aggregate functions for each data type are different and keeping them together would not be ideal. </p>

In [15]:
pd.set_option('display.float_format', '{:.2f}'.format)

<p> I have set the display format to display the values with 2 float points precision, without which the numbers are going to be shown with a scientific notation, which can be difficult to interpret. </p>

In [16]:
df.describe()

,individual_id,address_id,curr_ann_amt,days_tenure,age_in_years,latitude,longitude,income,has_children,length_of_residence,home_owner,college_degree,good_credit,Churn
count,1680909.00,1680909.00,1680909.00,1680909.00,1680909.00,1427190.00,1427190.00,1680909.00,1680909.00,1680909.00,1680909.00,1680909.00,1680909.00,1680909.00
mean,221301772745.74,521300683122.30,940.31,3602.01,55.82,32.85,-96.95,81497.73,0.52,7.50,0.82,0.35,0.84,0.12
std,992632.69,417471.09,246.54,2341.00,14.55,0.19,0.30,54381.00,0.50,5.14,0.38,0.48,0.37,0.32
min,221300000003.00,521300000001.00,-194.31,20.00,23.00,31.99,-98.02,5000.00,0.00,0.00,0.00,0.00,0.00,0.00
25%,221300905556.00,521300332982.00,772.10,1398.00,45.00,32.71,-97.17,47500.00,0.00,3.00,1.00,0.00,1.00,0.00
50%,221301808174.00,521300655449.00,935.01,3651.00,55.00,32.85,-96.90,70000.00,1.00,6.80,1.00,0.00,1.00,0.00
75%,221302711304.00,521300982572.00,1102.99,6291.00,64.00,32.98,-96.72,87500.00,1.00,13.00,1.00,1.00,1.00,0.00
max,221303307751.00,521301537315.00,2269.37,6291.00,114.00,33.55,-96.07,250000.00,1.00,15.00,1.00,1.00,1.00,1.00

<list>
    <li>
        Both the id columns are for identification purposes, which may have references to their real id. They have a large id number but we can just leave it like that, since we have no real use with them.
    </li>
    <li>
        The curr_ann_amount means the current amount the customer is paying for the insurance anually. It looks like there might be a few values that are negative which are un-realistic. This column need further investigation.
    </li>
    <li>
        Looks like the latitude and longitude columns have missing values. We will see if we can impute the missing values in these columns based on any other column, if not we will need to drop the records that have the missing values. Since we want to build a dashboard for the customer churn, it is not ideal to have missing values of the co-ordinates.
    </li>
</list>

In [12]:
df.describe(include='object')

,cust_orig_date,date_of_birth,city,state,county,marital_status,home_market_value,acct_suspd_date
count,1680909,1680909,1668842,1680909,1668842,1680909,1588623,193456
unique,5244,1085,95,1,14,2,19,300
top,2005-09-11,1967-07-07,Dallas,TX,Dallas,Married,75000 - 99999,2022-08-14
freq,495114,142238,305939,1680909,623980,1048453,306463,713

<list>
    <li>
        We have very few missing city and county values, which will be dropped, since it looks like there is no scope to replace them with any related column and the only way is to replace them with the mode of the county column.
    </li>
    <li>
        The home_market_value has a few missing values, which we will see if we can impute based on other related columns. Also the values are not numeric but ranges of type object. We will investigate further and make a decision whether to change the values to float or just leave them as they are.
    </li>
    <li>
        The acct_suspd_date is the date when the customer ended their insurance with the company. Although there are less churned records compared to the 1.68 million records it is safe to keep the column and check if we have any patterns among the churned customers.
    </li>
</list>

<h3> Dropping the records that have their <b>county</b> values missing</h3>

In [22]:
df = df.dropna(subset=['county'])

In [23]:
df.shape

(1668842, 22)

<p> A total of 12,067 records are dropped from the dataset </p>

<h3> Now let's take a look at the city column </h3>

In [36]:
df['city'].isna().sum()

0

<p> Looks like missing values in the city and county column are missing as pairs. Since the number of missing values in the city column are 0 now it is safe to proceed to the next steps. </p>

<h3> Imputing missing values in latitude and longitude columns </h3>

We are going to
<list>
    <li>
        Use median as our imputation metric
    </li>
    <li>
        Since latitude and longitudes are location specific and one median value is not going make sense, we will be calculating the median values for each city and impute in the respective latitude and longitude.
</list>

In [39]:
df['latitude'] = df.groupby('city')['latitude'].transform(lambda x: x.fillna(x.median()))

In [40]:
df['longitude'] = df.groupby('city')['longitude'].transform(lambda x: x.fillna(x.median()))

<p> Let us make sure we do not have any more missing values in the latitude and longitude columns </p>

In [42]:
df[['latitude', 'longitude']].isna().sum()

latitude     0
longitude    0
dtype: int64

We used the median by city over the KNN-Imputation for the following reasons.
<list>
    <li>
        The computation costs for 1.6 million records will be astronomical, which will lead to very slow processing times without significant hardware resources.
    </li>
    <li>
        As the number of records increases KNN imputation's performance also decreases, which makes median by city (or) county a far better option.
    </li>
    </list>

<h3>Imputing missing values in home_market_value column</h3>

<p>Since our main aim is to analyze the reasons for churn among the customers and suggest necessary steps to reduce it, we will not be performing any statistical analysis on the home_market_value's. Hence the best case will be to keep the <b>home_market_value</b> as a <b>object</b> type column.</p>

<p>We will group the records based on the city, latitude and longitude values then impute the values using mode value. </p>

<p> Both our latitude and longitude values have 6 decimal places. But we do not want to be using 6 decimal places when we group, since there will be a lot of groups and it is highly probable that groups may contain very few records which woud not be the best case senario. </p>
<p> To prevent this we will round up the latitude and longitude values to two decimal places into two new columns latitude_rounded, longitude_rounded.</p>

In [45]:
df['latitude_rounded'] = df['latitude'].round(2)
df['longitude_rounded'] = df['longitude'].round(2)

<p> Since we got the rounded latitude and longitude values, our next step would be to impute the missing values with mode. </p>

In [46]:
def impute_mode(series):
    mode = series.mode()
    if not mode.empty:
        return series.fillna(mode[0])
    else:
        return series

In [48]:
df['home_market_value'] = df.groupby(['city', 'latitude_rounded', 'longitude_rounded'])['home_market_value'].transform(impute_mode)

<p>Let us check and make sure there aren't anymore missing values in <b>home_market_value</b> column</p>

In [49]:
df['home_market_value'].isna().sum()

15

<p>Looks like we still have a few missing values to deal with.</p>

<p>What may have happened is</p>
<list>
    <li>
        The groupings would have resulted in just a single record which does not have any other values in the group to impute with.
    </li>
    <li>
        All the values in the group might have been missing and hence there are no non-missing values to impute them with.
    </li>
    </list>

<p>We can impute the remaining missing values by group them by just the city column</p>

In [50]:
df['home_market_value'] = df.groupby('city')['home_market_value'].transform(impute_mode)

Let's once again check if we have any missing values left in the <b>home_market_value</b> column

In [51]:
df['home_market_value'].isna().sum()

0

<p>Since there are no missing values left, let us check if there are any columns with missing values we need to deal with.</p>

In [52]:
df.isna().sum()

individual_id                0
address_id                   0
curr_ann_amt                 0
days_tenure                  0
cust_orig_date               0
age_in_years                 0
date_of_birth                0
latitude                     0
longitude                    0
city                         0
state                        0
county                       0
income                       0
has_children                 0
length_of_residence          0
marital_status               0
home_market_value            0
home_owner                   0
college_degree               0
good_credit                  0
acct_suspd_date        1476839
Churn                        0
latitude_rounded             0
longitude_rounded            0
dtype: int64

<p>There is only one column with missing values, but it is the account suspension date which only churned customer have, so we can leave the column as it is and proceed to further analysis.</p>

<h3>Converting Binary columns from float to Integer</h3>

<p>Columns such as <b> 'has_children', 'home_owner', 'college_degree' and 'good_credit'</b> are just to indicate just Yes or No, but they are of type float.</p>

<p>All those columns can be converted to <b>Integer</b> type for better memory efficency and clarity</p>

In [56]:
binary_cols = ['has_children', 'home_owner', 'college_degree', 'good_credit']  # add other binary columns as needed
df[binary_cols] = df[binary_cols].astype(int)

<p>Let us make sure all the columns are in our desired data type and the above columns are converted to Integer type</p>

In [57]:
df.dtypes

individual_id          float64
address_id             float64
curr_ann_amt           float64
days_tenure            float64
cust_orig_date          object
age_in_years             int64
date_of_birth           object
latitude               float64
longitude              float64
city                    object
state                   object
county                  object
income                 float64
has_children             int64
length_of_residence    float64
marital_status          object
home_market_value       object
home_owner               int64
college_degree           int64
good_credit              int64
acct_suspd_date         object
Churn                    int64
latitude_rounded       float64
longitude_rounded      float64
dtype: object

In [58]:
df.head()

,individual_id,address_id,curr_ann_amt,days_tenure,cust_orig_date,age_in_years,date_of_birth,latitude,longitude,city,state,county,income,has_children,length_of_residence,marital_status,home_market_value,home_owner,college_degree,good_credit,acct_suspd_date,Churn,latitude_rounded,longitude_rounded
0,221300017872.00,521300005982.00,818.88,1454.00,2018-12-09,44,1978-06-23,32.58,-96.31,Kaufman,TX,Kaufman,22500.00,1,15.00,Married,50000 - 74999,1,1,1,NaN,0,32.58,-96.31
1,221300134410.00,521300051115.00,974.20,1795.00,2018-01-02,72,1950-05-30,32.73,-97.00,Grand Prairie,TX,Dallas,27500.00,0,2.00,Single,50000 - 74999,1,0,0,NaN,0,32.73,-97.00
2,221300673028.00,521300247929.00,967.38,4818.00,2009-09-23,55,1967-07-07,32.82,-96.85,Dallas,TX,Dallas,42500.00,0,10.00,Married,75000 - 99999,1,0,0,NaN,0,32.82,-96.85
3,221301573419.00,521300570147.00,992.41,130.00,2022-07-25,53,1969-05-25,32.68,-97.16,Arlington,TX,Tarrant,125000.00,1,6.00,Married,175000 - 199999,1,0,1,2021-12-22,1,32.68,-97.16
4,221301622347.00,521300588399.00,784.63,5896.00,2006-10-11,50,1972-09-25,32.75,-97.38,Fort Worth,TX,Tarrant,87500.00,1,4.00,Married,225000 - 249999,1,1,1,NaN,0,32.75,-97.38

In [59]:
df.isna().sum()

individual_id                0
address_id                   0
curr_ann_amt                 0
days_tenure                  0
cust_orig_date               0
age_in_years                 0
date_of_birth                0
latitude                     0
longitude                    0
city                         0
state                        0
county                       0
income                       0
has_children                 0
length_of_residence          0
marital_status               0
home_market_value            0
home_owner                   0
college_degree               0
good_credit                  0
acct_suspd_date        1476839
Churn                        0
latitude_rounded             0
longitude_rounded            0
dtype: int64

<p> We can drop the <b>'latitude_rounded'</b> and <b>'longitude_rounded'</b>, since we already have the original columns.</p>

<p>The <b>'latitude'</b> and <b>'longitude'</b> columns are rounded to two decimal points and they represent with a precision of 1.1 kilometer or 0.7 miles at the equator.</p>

<p> Since we are not going to examine based on the region but not the exact address, the two decimal point precision will work just fine</p>

In [60]:
df = df.drop(['latitude_rounded', 'longitude_rounded'], axis=1)

<p>Let us make sure both the columns are dropped and then we will be ready to export the dataset</p>

In [61]:
df.head()

,individual_id,address_id,curr_ann_amt,days_tenure,cust_orig_date,age_in_years,date_of_birth,latitude,longitude,city,state,county,income,has_children,length_of_residence,marital_status,home_market_value,home_owner,college_degree,good_credit,acct_suspd_date,Churn
0,221300017872.00,521300005982.00,818.88,1454.00,2018-12-09,44,1978-06-23,32.58,-96.31,Kaufman,TX,Kaufman,22500.00,1,15.00,Married,50000 - 74999,1,1,1,NaN,0
1,221300134410.00,521300051115.00,974.20,1795.00,2018-01-02,72,1950-05-30,32.73,-97.00,Grand Prairie,TX,Dallas,27500.00,0,2.00,Single,50000 - 74999,1,0,0,NaN,0
2,221300673028.00,521300247929.00,967.38,4818.00,2009-09-23,55,1967-07-07,32.82,-96.85,Dallas,TX,Dallas,42500.00,0,10.00,Married,75000 - 99999,1,0,0,NaN,0
3,221301573419.00,521300570147.00,992.41,130.00,2022-07-25,53,1969-05-25,32.68,-97.16,Arlington,TX,Tarrant,125000.00,1,6.00,Married,175000 - 199999,1,0,1,2021-12-22,1
4,221301622347.00,521300588399.00,784.63,5896.00,2006-10-11,50,1972-09-25,32.75,-97.38,Fort Worth,TX,Tarrant,87500.00,1,4.00,Married,225000 - 249999,1,1,1,NaN,0

<p>As our dataset is clean now we can proceed and export it in the desired format.</p>
<p>I am going to export it to csv format, since I can use it to import with Tableau Public.</p>

In [62]:
df.to_csv('../Clean Data/autoinsurance_churn_cleaned.csv', index=False)